package org.example;

import java.util.List;

public class OrderGenerator {
    // Метод для создания заказа с черным цветом
    public static Order getWithBlackColor() {
        return new Order("Ivan", // Имя заказчика
                "Ivanov", // Фамилия заказчика
                "Moscow, Melnikova Street, 22", // Адрес доставки
                "1", // Станция метро
                "+7 800 355 35 35", // Номер телефона заказчика
                5, // Время аренды (в часах)
                "2025-03-15", // Дата доставки
                "Hello!", // Комментарий к заказу
                List.of("BLACK") // Список выбранных цветов (в данном случае - черный)
        );
    }

    // Метод для создания заказа с серым цветом
    public static Order getWithGreyColor() {
        return new Order("Ivan", // Имя заказчика
                "Ivanov", // Фамилия заказчика
                "Moscow, Melnikova Street, 22", // Адрес доставки
                "1", // Станция метро
                "+7 800 355 35 35", // Номер телефона заказчика
                5, // Время аренды (в часах)
                "2025-03-15", // Дата доставки
                "Hello!", // Комментарий к заказу
                List.of("GREY") // Список выбранных цветов (в данном случае - серый)
        );
    }

    // Метод для создания заказа с черным и серым цветами
    public static Order getWithBlackAndGrayColors() {
        return new Order("Ivan", // Имя заказчика
                "Ivanov", // Фамилия заказчика
                "Moscow, Melnikova Street, 22", // Адрес доставки
                "1", // Станция метро
                "+7 800 355 35 35", // Номер телефона заказчика
                5, // Время аренды (в часах)
                "2025-03-15", // Дата доставки
                "Hello!", // Комментарий к заказу
                List.of("BLACK", "GREY") // Список выбранных цветов (черный и серый)
        );
    }

    // Метод для создания заказа без указания цвета
    public static Order getWithoutColor() {
        return new Order("Ivan", // Имя заказчика
                "Ivanov", // Фамилия заказчика
                "Moscow, Melnikova Street, 22", // Адрес доставки
                "1", // Станция метро
                "+7 800 355 35 35", // Номер телефона заказчика
                5, // Время аренды (в часах)
                "2025-03-15", // Дата доставки
                "Hello!", // Комментарий к заказу
                List.of() // Пустой список цветов (без цвета)
        );
    }
}